### 판다스 (pandas)
데이터를 관리하기 위한 모듈로, 시리즈와 데이터 프레임을 제공함

In [1]:
# 모듈 불러오기
# 넘파이 모듈을 np라고 부른다
import numpy as np
# 판다스 모듈을 pd라고 부른다
import pandas as pd

#### 4.1 시리즈(series)  
<small>
데이터를 한줄로 담는 자료 구조이다<br>
리스트와 다른 점은 데이터에 이름표를 붙일 수 있다(index)
</small>

시리즈 생성 1

In [4]:
# 시리즈 생성
s = pd.Series( [1,2,3,4] )
print(s)
# 인덱스가 자동으로 설정됨(0~3)
# 시리즈의 인덱스 확인
s.index

0    1
1    2
2    3
3    4
dtype: int64

RangeIndex(start=0, stop=4, step=1)

#### 4.2 데이터 프레임(DataFrame)
<small>
    표 형식의 2차원 데이터를 담기 위한 자료 구조
    </small>

데이터 프레임 생성

In [7]:
# 도시별 인구 데이터를 담은 데이터 프레임 생성
# 데이터 먼저 만들기(dic)
data = {'city':['서울', '인천'],
       'pop' : [990, 240]}
# 데이터 프레임 생성 / city, pop 열 두개를 담고 있는 데이터 프레임
df = pd.DataFrame(data)
df

# 행열의 이름을 따로 설정하지 않으면 자동으로 설정됨
print(df.index) # 행 이름 : 0,1
print(df.columns) # 열 이름 : dic의 key (city, pop)

RangeIndex(start=0, stop=2, step=1)
Index(['city', 'pop'], dtype='object')

데이터 프레임 생성 2

In [33]:
# 학생 성적 데이터 만들기
# dic, list
# 넘파이의 다차원 배열 사용하여 2차원 배열 생성
data = np.array([[60,70,80], [70,80,90], [80,90,100]])
data

# 성적 데이터를 담아서 데이터 프레임 생성
# 이점수가 누구의 어떤 점수인지 알기 위해, 이름표 붙이기
# 행 이름 : 학생의 이름
# 열 이름 : 과목명
df = pd.DataFrame(data, index=['둘리','또치','도우너'], columns=['국어','영어','수학'])
# 행 인덱스
df.index
# 열 컬럼
df.columns

Index(['국어', '영어', '수학'], dtype='object')

데이터 프레임에서 데이터 꺼내기  
<small>
    loc : 행열 이름으로 데이터를 꺼낸다<br>
    iloc : 행열 위치로 데이터를 꺼낸다<br>
    [] : 행열 이름으로 데이터를 꺼낸다<br>
    </small>

In [34]:
print(df)
# loc[행이름, 열이름]
df.loc[:,:] # 전체 데이터

# 둘리의 국어 점수
df.loc['둘리','국어']

# 도우너의 수학 점수
df.loc['도우너','수학']

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

np.int64(100)

In [35]:
# 프레임에서 []대괄호를 쓰면, 열만 입력 가능!
# [열이름]
# 모든 학생의 국어 점수
df['국어']
# 모든 학생의 영어 점수
df['영어']

둘리     70
또치     80
도우너    90
Name: 영어, dtype: int64

데이터 프레임에 새로운 열 추가

In [36]:
# 새로운 과목 추가
# 새로운 열 = 리스트
# 맨 뒤에 추가됨
# df['과학'] = [60,70,80]
# df
# 이번에는 2번째 위치에 '미술' 과목을 추가
# insert(위치, 컬럼명, 값리스트)
df.insert(2, '미술', [70,80,90])
df

     국어  영어  미술   수학
둘리   60  70  70   80
또치   70  80  80   90
도우너  80  90  90  100

데이터 프레임에서 열 삭제  
<small>
    del : 원본에서 바로 삭제<br>
    drop : 원본은 그대로, 결과만 보여줌
    </small>

In [38]:
# 과학 과목 삭제
# del df['과학']
# df

In [41]:
# 수학 과목 삭제
# drop(형 또는 열의 이름, 방향)
# axis = 1 또는 axis='columns'
# result = df.drop('수학', axis = 1)
# result

# 또치 학생 삭제(행 삭제)
# axis = 0 또는 axis='row'
df = df.drop('또치', axis=0)
df

     국어  영어  미술   수학
둘리   60  70  70   80
도우너  80  90  90  100

#### 4.3 데이터 게산과 처리

시리즈에서 계산과 조건 검색

In [43]:
# 숫자가 담긴 시리즈 생성
s = pd.Series([-2, -1, 0, 1, 2])
# 모든 원소에 1만큼 더하기
# 판다스의 시리즈는 for 없이 반복 수행 가능
# 아래 계산식은 자동으로 더하기가 6번 반복 수행
# s + 1
s.add(1)

0   -1
1    0
2    1
3    2
4    3
dtype: int64

In [45]:
# 조건 검색( 양수만 찾기 )
# 불리언 배열 만들기
s > 0
# 불리언 배열은 시리즈와 인덱스로 사용할 수 있다
# true인 값만 나올
s[s>0]

3    1
4    2
dtype: int64

In [50]:
# 조건 검색 2 ( 짝수만 찾기 )
s = pd.Series(np.arange(1,11))
s
# 짝수만 찾기
s[s%2==0]

1     2
3     4
5     6
7     8
9    10
dtype: int64

데이터 프레임에서 계산과 처리

In [57]:
# 학생 성적 데이터 만들기
data = np.array([ [60,70,80], [70,80,90], [80,90,100] ])
# 성적데이터를 담아서 프레임 생성
df = pd.DataFrame(data,
                 index=['둘리','또치','도우너'],
                 columns=['국어','영어','수학'])
df

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

In [53]:
# 국어 과목만 조회
df['국어']
# 국어과목에 담겨있는 값의 자료형
df['국어'].dtype
# 국어과목의 자료 구조
type(df['국어'])

pandas.core.series.Series

In [55]:
# 전체 점수에 1점씩 더하기
# 데이터 프레임 전체 데이터에 더하기가 적용됨
df + 1
# 국어 점수만 10점씩 더하기
df['국어'] + 1

둘리     61
또치     71
도우너    81
Name: 국어, dtype: int64

In [56]:
# 조건 검색(국어 점수가 70점 이상인 학생만 찾기)
df['국어']>=70
# 프레임에 bool 배열을 인덱스로 사용
df[df['국어']>=70]

     국어  영어   수학
또치   70  80   90
도우너  80  90  100

데이터프레임의 정렬  
<small>
    시험 성적 순위를 매길때 사용
    </small>

In [59]:
# 학생 성적 데이터 초기화
data = np.array([ [60,70,80], [70,80,90], [80,90,100] ])
# 성적데이터를 담아서 프레임 생성
df = pd.DataFrame(data,
                 index=['둘리','또치','도우너'],
                 columns=['국어','영어','수학'])
df

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

In [61]:
# 시험 성적에서 국어 점수를 기준으로 정렬
df.sort_values('국어')
# 국어 점수를 기준으로 내림차순 정렬
# 정렬 기준: 오름차순(1->10) / 내림차순(10->1)
# ascending : 오름차순(True) 내림차순(False)
df.sort_values('국어', ascending=False)

     국어  영어   수학
도우너  80  90  100
또치   70  80   90
둘리   60  70   80

In [83]:
# 학생 데이터 생성
# 랜덤 함수로 시험 점수 생성
# 범위 : 60~100점
# 개수 : 9개
data = np.random.randint(60, 100, 9)
# 2차원 배열로변환
arr = data.reshape(3, 3)
arr
# 프레임 생성
df = pd.DataFrame(arr,
                  index=['둘리','또치','도우너'],
                  columns=['수학','영어','과학']
                 )
print(df)
# 영어 점수가 높은 사람 순으로 정렬 (내림차순)
df.sort_values('영어', ascending=False)

     수학  영어  과학
둘리   86  64  94
또치   90  68  90
도우너  65  99  70

     수학  영어  과학
도우너  65  99  70
또치   90  68  90
둘리   86  64  94

nan 처리  
<small>
    누락된값, 빈값  
    예를 들어 엑셀에서 빈셀을 표현할 때 사용  
    nan은 float타입에서만 표현 가능
</small>

In [84]:
df

     수학  영어  과학
둘리   86  64  94
또치   90  68  90
도우너  65  99  70

In [86]:
# 둘리의 영어점수를 빈값(nan)으로 표시
# 빈값을 넣으면 해당 값이 들어간 열리 float 타입으로 자동 형변환됨
# df.loc['둘리','영어'] = np.nan
# df['영어'].dtype
df

     수학    영어  과학
둘리   86   NaN  94
또치   90  68.0  90
도우너  65  99.0  70

In [87]:
# 빈값이 있는 행 또는 열 삭제
# 엑시스 0 'row' => 행
# 삭제를 반영하기 위해서, 결과를 df에 덮어씌우기!
df = df.dropna(axis=0)
df

     수학    영어  과학
또치   90  68.0  90
도우너  65  99.0  70

In [88]:
# 또치의 과학 점수를 빈값으로 설정
df.loc['또치','과학']=np.nan
df

     수학    영어    과학
또치   90  68.0   NaN
도우너  65  99.0  70.0

In [89]:
df.fillna(0)

     수학    영어    과학
또치   90  68.0   0.0
도우너  65  99.0  70.0

#### 4.4 데이터 탐색  
<small>
    데이터의 상태나 특징을 파악하는 작업
</small>

In [2]:
# 과일 목록을 담은 시리즈 생성
s = pd.Series(['사과','배','사과','배','바나나'])
s

0     사과
1      배
2     사과
3      배
4    바나나
dtype: object

In [3]:
# 중복을 제거하고 유니크한 값만 남기기
s.unique()

array(['사과', '배', '바나나'], dtype=object)

In [4]:
# 원소별 개수 세기
s.value_counts()

사과     2
배      2
바나나    1
Name: count, dtype: int64